/*  Есть объект формы

    * Напишите вспомогательные функции, обеспечивающие проверку валидности данных (обязательное поле, минимальная и
      максимальная длина, емейл). Не используйте регулярные выражения.
    * Объедините все функции в одну функцию validation(formObject), которая принимает в себя параметром объект формы
      и возвращает true/false в зависимости от того, валидны ли введенные данные.
    * Как вариант альтернативного решения, объедините вспомогательные функции в объект validation с методами
      (*это необязательное дополнительное задание).
    * Можете менять названия функций и переменных по своему усмотрению.
*/

